modules/models/Admin.php

  public function validatepass() {
    if (!$this->hasErrors()) {
      $data = self::find()->where('adminuser = :user and adminpass = :pass',
        [':user' => $this->adminuser, ':pass' => md5($this->adminpass)])->one();
---
SELECT * FROM `nx_admin` WHERE adminuser = 'admin' and adminpassword = '3e3806659785b5be6b7a3209212e9f3e'

  public function login($data) {
    $this->scenario = 'login';
    if ($this->load($data) && $this->validate()) {
      $lifetime = $this->rememberMe ? 3600 * 23 : 0;
      $session = Yii::$app->session;
      session_set_cookie_params($lifetime);
      $session['admin'] = [
        'adminuser' => $this->adminuser,
        'isLogin' => 1,
      ];
      $this->updateAll(['logintime' => time(), 'loginip' => ip2long(Yii::$app->request->userIP)], 'adminuser = :user', [':user' => $this->adminuser]);
---
UPDATE `nx_admin` SET `logintime`='1483497910', `loginip`='-1062668543' WHERE adminuser = 'admin'

  public function mailChangepass($data) {
    $this->scenario = "mailchangepass";
    if ($this->load($data) && $this->validate()) {
      return (bool)self::updateAll(['adminpass' => md5($this->adminpass)], 'adminuser = :user', [':user' => $this->adminuser]);
---
UPDATE `nj_admin` SET `adminpassword`='3e3806659785b5be6b7a3209212e9f3e' WHERE adminuser = 'admin'

  public function reg($data) {
    $this->scenario = "reg";
    if ($this->load($data) && $this->validate()) {
      $this->adminpass = md5($this->adminpass);
      if ($this->save(false)) {
---
UPDATE `nj_admin` SET `adminemail`='mcyzlizhun@163.com' WHERE adminuser = 'admin'

  public function changepass($data) {
    $this->scenario = "changepass";
    if ($this->load($data) && $this->validate()) {
      return (bool)self::updateAll(['adminpass' => md5($this->newpass)], 'adminuser = :user', [':user' => $this->adminuser]);
---
UPDATE `nj_admin` SET `adminpassword`='3e3806659785b5be6b7a3209212e9f3e' WHERE adminuser = 'admin'