modules/controllers/ManageController.php

  public function actionManagers() {
    $this->layout = 'layout';
    $model = Admin::find();
    $count = $model->count();
    $pageSize = Yii::$app->params['pageSize']['manage'];
    $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
    $managers = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `nx_admin`
SELECT * FROM `nx_admin` LIMIT 10